In [1]:
import numpy as np
import pandas as pd

In [3]:
pd.notnull(np.nan)

False

In [22]:
s = pd.Series([1,2,3,np.nan, np.nan, 4])

In [5]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [6]:
pd.notnull(s).sum()

4

In [7]:
pd.isnull(s).sum()

2

In [8]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [9]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [11]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [12]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [17]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [18]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [23]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [31]:
df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94 , 60.665, 127.061, 64.511, 318.523],
    'GDP': [
        1785387,
        2833687,
        3874437,
        2167744,
        np.nan,
        2950039,
        17348075
    ],
    'Surface Area': [
        9984670,
        640679,
        357114,
        301336,
        377930,
        242495,
        9525067
    ],
    'HDI': [
        0.913,
        0.888,
        0.916,
        0.873,
        0.891,
        np.nan,
        0.915
    ],
    'Continent': [
        'America',
        'Europe',
        'Europe',
        'Europe',
        'Asia',
        'Europe',
        'America'
    ]
}, columns=['Population', 'GDP', 'Surface Area', 'HDI', 'Continent'],
    index=['Canada','France','Germany','Italy','Japan','United Kingdom','United States'])

In [28]:
df

                Population         GDP  Surface Area    HDI Continent
Canada              35.467   1785387.0       9984670  0.913   America
France              63.951   2833687.0        640679  0.888    Europe
Germany             80.940   3874437.0        357114  0.916    Europe
Italy               60.665   2167744.0        301336  0.873    Europe
Japan              127.061         NaN        377930  0.891      Asia
United Kingdom      64.511   2950039.0        242495    NaN    Europe
United States      318.523  17348075.0       9525067  0.915   America

In [29]:
df.isnull()

                Population    GDP  Surface Area    HDI  Continent
Canada               False  False         False  False      False
France               False  False         False  False      False
Germany              False  False         False  False      False
Italy                False  False         False  False      False
Japan                False   True         False  False      False
United Kingdom       False  False         False   True      False
United States        False  False         False  False      False

In [32]:
df.isnull().sum()

Population      0
GDP             1
Surface Area    0
HDI             1
Continent       0
dtype: int64

In [33]:
df.shape

(7, 5)

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Canada to United States
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Population    7 non-null      float64
 1   GDP           6 non-null      float64
 2   Surface Area  7 non-null      int64
 3   HDI           6 non-null      float64
 4   Continent     7 non-null      object
dtypes: float64(3), int64(1), object(1)
memory usage: 336.0+ bytes

In [35]:
df.dropna()

               Population         GDP  Surface Area    HDI Continent
Canada             35.467   1785387.0       9984670  0.913   America
France             63.951   2833687.0        640679  0.888    Europe
Germany            80.940   3874437.0        357114  0.916    Europe
Italy              60.665   2167744.0        301336  0.873    Europe
United States     318.523  17348075.0       9525067  0.915   America

In [38]:
df.dropna(thresh=5)

               Population         GDP  Surface Area    HDI Continent
Canada             35.467   1785387.0       9984670  0.913   America
France             63.951   2833687.0        640679  0.888    Europe
Germany            80.940   3874437.0        357114  0.916    Europe
Italy              60.665   2167744.0        301336  0.873    Europe
United States     318.523  17348075.0       9525067  0.915   America

In [39]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [40]:
s.fillna(method='ffill')

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [41]:
s.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [42]:
df.fillna(method='ffill',axis=0) #if axis is zero it will fill by column

                Population         GDP  Surface Area    HDI Continent
Canada              35.467   1785387.0       9984670  0.913   America
France              63.951   2833687.0        640679  0.888    Europe
Germany             80.940   3874437.0        357114  0.916    Europe
Italy               60.665   2167744.0        301336  0.873    Europe
Japan              127.061   2167744.0        377930  0.891      Asia
United Kingdom      64.511   2950039.0        242495  0.891    Europe
United States      318.523  17348075.0       9525067  0.915   America

In [45]:
df.fillna(method='ffill',axis=1) #if axis is one it will fill by row

               Population         GDP Surface Area     HDI Continent
Canada             35.467   1785387.0      9984670   0.913   America
France             63.951   2833687.0       640679   0.888    Europe
Germany             80.94   3874437.0       357114   0.916    Europe
Italy              60.665   2167744.0       301336   0.873    Europe
Japan             127.061     127.061       377930   0.891      Asia
United Kingdom     64.511   2950039.0       242495  242495    Europe
United States     318.523  17348075.0      9525067   0.915   America

In [46]:
s.isnull().sum()

2

In [47]:
df.isnull().sum()

Population      0
GDP             1
Surface Area    0
HDI             1
Continent       0
dtype: int64

In [48]:
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index=[
    'Gérard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth '
])

In [49]:
ambassadors.duplicated() #topdown

Gérard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [54]:
ambassadors.duplicated(keep = 'last') #bottomup

Gérard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [73]:
df = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985_F_I  T_2'
]})

In [56]:
df

              Data
0     1987_M_US _1
1     1990?_M_UK_1
2      1992_F_US_2
3  1970?_M_   IT_1
4    1985_F_I  T_2

In [74]:
df['Data'].str.split('_')

0       [1987, M, US , 1]
1       [1990?, M, UK, 1]
2        [1992, F, US, 2]
3    [1970?, M,    IT, 1]
4      [1985, F, I  T, 2]
Name: Data, dtype: object

In [75]:
df['Data'].str.split('_', expand = True)

       0  1      2  3
0   1987  M    US   1
1  1990?  M     UK  1
2   1992  F     US  2
3  1970?  M     IT  1
4   1985  F   I  T  2

In [76]:
df = df['Data'].str.split('_', expand = True)

In [60]:
df

       0  1      2  3
0   1987  M    US   1
1  1990?  M     UK  1
2   1992  F     US  2
3  1970?  M     IT  1
4   1985  F   I  T  2

In [85]:
df.columns = ['Year', 'Sex','Country','Children']

In [62]:
df

    Year Sex Country Children
0   1987   M     US         1
1  1990?   M      UK        1
2   1992   F      US        2
3  1970?   M      IT        1
4   1985   F    I  T        2

In [86]:
df['Country'].str.strip()

0      US
1      UK
2      US
3      IT
4    I  T
Name: Country, dtype: object

In [95]:
df['Country'] = df['Country'].str.replace(' ','')

In [96]:
df

    Year Sex Country Children
0   1987   M      US        1
1  1990?   M      UK        1
2   1992   F      US        2
3  1970?   M      IT        1
4   1985   F      IT        2

In [99]:
df['Year'] = df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'))

C:\Users\rokzu\AppData\Local\Temp\ipykernel_5904\1440786730.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['Year'] = df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'))

In [100]:
df

   Year Sex Country Children
0  1987   M      US        1
1  1990   M      UK        1
2  1992   F      US        2
3  1970   M      IT        1
4  1985   F      IT        2